### map,apply,applymap

### map
 
- map is a method of pandas.Series 
- map each value of series
- iterates over each element of a series.
- where we have categorical variables or features

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('dataset/train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df['Sex_column'] = df.Sex.map({'female':0,'male':1})

In [5]:
df.loc[0:4,['Sex','Sex_column']]

      Sex  Sex_column
0    male           1
1  female           0
2  female           0
3  female           0
4    male           1

In [6]:
print df.Embarked.unique()
print df.Embarked.nunique()

['S' 'C' 'Q' nan]
3

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
Sex_column       int64
dtype: object

### pandas.Series.apply or pandas.DataFrame.apply

- a DataFrame or Series method
- applies a function along each element of dataframe or series.

In [8]:
import numpy as np

In [9]:
def toupper(x):
    if x=='female':
        return str.upper(x)
    else:
        return x

In [10]:
df['Sex_new']=df.Sex.apply(lambda x:str.upper(x) if x=='female'  else x)

In [11]:
df.loc[:,['Sex','Sex_new']].head()

      Sex Sex_new
0    male    male
1  female  FEMALE
2  female  FEMALE
3  female  FEMALE
4    male    male

In [12]:
df['Sex_new'] = df.Sex_new.apply(lambda x:str.lower(x))

In [13]:
df.loc[:,['Sex','Sex_new']].head()

      Sex Sex_new
0    male    male
1  female  female
2  female  female
3  female  female
4    male    male

In [14]:
#df['Fare_new']=df.Fare.apply(np.around,args=(1,))
# in args(),we pass only positional argrments as a tuple

df['Fare_new']=df.Fare.apply(np.around,decimals=1)
# or pass keyword arguments to a function

In [15]:
df.loc[:,['Fare','Fare_new']].head()

      Fare  Fare_new
0   7.2500       7.2
1  71.2833      71.3
2   7.9250       7.9
3  53.1000      53.1
4   8.0500       8.0

In [16]:
drinks = pd.read_csv('dataset/drinks.csv')

In [18]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [21]:
drinks.loc[:,'beer_servings':'wine_servings'].head()

   beer_servings  spirit_servings  wine_servings
0              0                0              0
1             89              132             54
2             25                0             14
3            245              138            312
4            217               57             45

In [28]:
#find maximum value 
drinks.iloc[:,1:4].apply(max,axis=0)  
#drinks.iloc[:,1:4].apply(max,axis=1)  #for row
#drinks.loc[drinks.iloc[:,1:4].apply(np.argmax,axis=0),:]

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [29]:
drinks.loc[drinks.iloc[:,1:4].apply(np.argmax,axis=0),:]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
117,Namibia,376,3,1,6.8,Africa
68,Grenada,199,438,28,11.9,North America
61,France,127,151,370,11.8,Europe

In [30]:
#convert all numerical values in dataframe into float

#applymap apply function on each value of dataframe
drinks.iloc[:,:].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [31]:
drinks.iloc[:,1:5].applymap(float).head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0            0.0              0.0            0.0                           0.0
1           89.0            132.0           54.0                           4.9
2           25.0              0.0           14.0                           0.7
3          245.0            138.0          312.0                          12.4
4          217.0             57.0           45.0                           5.9

In [32]:
drinks.iloc[:,1:5]=drinks.iloc[:,1:5].applymap(float)

In [33]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0.0,0.0,0.0,0.0,Asia
1,Albania,89.0,132.0,54.0,4.9,Europe
2,Algeria,25.0,0.0,14.0,0.7,Africa
3,Andorra,245.0,138.0,312.0,12.4,Europe
4,Angola,217.0,57.0,45.0,5.9,Africa